from PIL import Image
import numpy as np


# GID15类的色板
# palette = [0, 0, 0, 200, 0, 0, 250, 0, 150, 200, 150, 150, 250, 150, 150, 0, 200, 0,
#            150, 250, 0, 150, 200, 150, 200, 0, 200, 150, 0, 250, 150, 150, 250,
#            250, 200, 0, 200, 200, 0, 0, 0, 200, 0, 150, 200, 0, 200, 250]

# 自定义色板1
# palette = [0, 200, 0, 150, 250, 0, 150, 200, 150, 200, 0, 200, 150, 0, 250, 150, 150, 250, 250, 200, 0, 200, 200, 0,
#            200, 0, 0, 250, 0, 150, 200, 150, 150, 250, 150, 150, 0, 0, 200, 0, 150, 200, 0, 200, 250, 0, 0, 0]

# Potsdam六类的色板
# palette = [255, 0, 0, 255, 255, 255, 0, 0, 255, 0, 255, 255, 0, 255, 0, 255, 255, 0]

# whu_sar_opt官方色板
palette = [0, 0, 0, 204, 102, 0, 255, 0, 0, 255, 255, 0, 0, 0, 255, 85, 167, 0, 0, 255, 255, 153, 102, 153]


# palette = [0, 0, 0,
#            115, 74, 18,
#            255, 0, 0,
#            255, 255, 0,
#            0, 0, 255,
#            34, 139, 34,
#            0, 255, 255,
#            159, 101, 149]

zero_pad = 256 * 3 - len(palette)
for i in range(zero_pad):
    palette.append(0)


# 将grey mask转化为彩色mask
def colorize_mask(mask, dataset_name):
    if dataset_name == 'eight':
        data_palette = [0, 0, 0, 204, 102, 0, 255, 0, 0, 255, 255, 0, 0, 0, 255, 85, 167, 0, 0, 255, 255, 153, 102, 153]
    elif dataset_name == 'six':
        data_palette = [255, 0, 0, 255, 255, 255, 0, 0, 255, 0, 255, 255, 0, 255, 0, 255, 255, 0]
    mask_color = Image.fromarray(mask.astype(np.uint8)).convert('P')
    mask_color.putpalette(data_palette)
    return mask_color
